OdPseudoConstructorType
\details
Defines OdPseudoConstructorType as a function pointer type.
\remarks
Functions pointed to by OdPseudoConstructorType
take no arguments and construct instances of
classes derived from OdRxObject;
hence the name PseudoConstructorType.